Repository: brunoleocam/ZPL2PDF
Catalog: Resources/Messages.*.resx
Languages: de, es, fr, it, ja, pt_br, zh

# APPLICATION_DESCRIPTION
source: ZPL to PDF Converter
de: ZPL zu PDF Konverter
es: Conversor ZPL a PDF
fr: Convertisseur ZPL vers PDF
it: Convertitore ZPL in PDF
ja: ZPLからPDFへのコンバーター
pt_br: Conversor ZPL para PDF
zh: ZPL到PDF转换器

# HELP_TITLE
source: ZPL2PDF - ZPL to PDF Converter
de: ZPL2PDF - ZPL zu PDF Konverter
es: ZPL2PDF - Conversor ZPL a PDF
fr: ZPL2PDF - Convertisseur ZPL vers PDF
it: ZPL2PDF - Convertitore ZPL in PDF
ja: ZPL2PDF - ZPLからPDFへのコンバーター
pt_br: ZPL2PDF - Conversor ZPL para PDF
zh: ZPL2PDF - ZPL到PDF转换器

# HELP_DEFAULT_BEHAVIOR
source: DEFAULT BEHAVIOR:
de: STANDARDVERHALTEN:
es: COMPORTAMIENTO PREDETERMINADO:
fr: COMPORTEMENT PAR DÉFAUT :
it: COMPORTAMENTO PREDETERMINATO:
ja: デフォルトの動作:
pt_br: COMPORTAMENTO PADRÃO:
zh: 默认行为:

# HELP_DEFAULT_USAGE
source: Usage: ZPL2PDF.exe [options]
de: Verwendung: ZPL2PDF.exe [Optionen]
es: Uso: ZPL2PDF.exe [opciones]
it: Uso: ZPL2PDF.exe [opzioni]
ja: 使用方法: ZPL2PDF.exe [オプション]
pt_br: Uso: ZPL2PDF.exe [opções]
zh: 用法: ZPL2PDF.exe [选项]

# HELP_DEFAULT_DESCRIPTION
source: Running without arguments starts daemon mode (same as 'start' command)
de: Ausführen ohne Argumente startet den Daemon-Modus (wie der 'start' Befehl)
es: Ejecutar sin argumentos inicia el modo daemon (igual que comando 'start')
fr: Exécuter sans arguments démarre le mode daemon (même que la commande 'start')
it: Eseguire senza argomenti avvia la modalità daemon (come il comando 'start')
ja: 引数なしで実行するとデーモンモードが開始されます（'start'コマンドと同じ）
pt_br: Executar sem argumentos inicia o modo daemon (mesmo que comando 'start')
zh: 不带参数运行将启动守护进程模式（与'start'命令相同）

# HELP_CONVERSION_MODE
source: CONVERSION MODE:
de: KONVERTIERUNGSMODUS:
es: MODO CONVERSIÓN:
fr: MODE CONVERSION :
it: MODALITÀ CONVERSIONE:
ja: 変換モード:
pt_br: MODO CONVERSÃO:
zh: 转换模式:

# HELP_CONVERSION_USAGE
source: Usage: ZPL2PDF.exe -i <input_file_path> -o <output_folder_path> [-n <output_file_name>] | -z <zpl_content>
de: Verwendung: ZPL2PDF.exe -i <Eingabedateipfad> -o <Ausgabeordner> [-n <Ausgabedateiname>] | -z <ZPL-Inhalt>
es: Uso: ZPL2PDF.exe -i <ruta_archivo_entrada> -o <carpeta_salida> [-n <nombre_archivo_salida>] | -z <contenido_zpl>
fr: Usage : ZPL2PDF.exe -i <chemin_fichier_entrée> -o <dossier_sortie> [-n <nom_fichier_sortie>] | -z <contenu_zpl>
it: Uso: ZPL2PDF.exe -i <percorso_file_input> -o <cartella_output> [-n <nome_file_output>] | -z <contenuto_zpl>
ja: 使用方法: ZPL2PDF.exe -i <入力ファイルパス> -o <出力フォルダ> [-n <出力ファイル名>] | -z <ZPLコンテンツ>
pt_br: Uso: ZPL2PDF.exe -i <caminho_arquivo_entrada> -o <pasta_saida> [-n <nome_arquivo_saida>] | -z <conteudo_zpl>
zh: 用法: ZPL2PDF.exe -i <输入文件路径> -o <输出文件夹> [-n <输出文件名>] | -z <ZPL内容>

# HELP_DAEMON_MODE
source: DAEMON MODE:
de: DAEMON-MODUS:
es: MODO DAEMON:
fr: MODE DAEMON :
it: MODALITÀ DAEMON:
ja: デーモンモード:
pt_br: MODO DAEMON:
zh: 守护进程模式:

# HELP_DAEMON_USAGE
source: Usage: ZPL2PDF.exe start [options] | stop | status | run [options]
de: Verwendung: ZPL2PDF.exe start [Optionen] | stop | status | run [Optionen]
es: Uso: ZPL2PDF.exe start [opciones] | stop | status | run [opciones]
it: Uso: ZPL2PDF.exe start [opzioni] | stop | status | run [opzioni]
ja: 使用方法: ZPL2PDF.exe start [オプション] | stop | status | run [オプション]
pt_br: Uso: ZPL2PDF.exe start [opções] | stop | status | run [opções]
zh: 用法: ZPL2PDF.exe start [选项] | stop | status | run [选项]

# DAEMON_STARTED_SUCCESS
source: Daemon started successfully! PID: {0}
de: Daemon erfolgreich gestartet! PID: {0}
es: ¡Daemon iniciado con éxito! PID: {0}
fr: Daemon démarré avec succès ! PID : {0}
it: Daemon avviato con successo! PID: {0}
ja: デーモンが正常に開始されました！PID: {0}
pt_br: Daemon iniciado com sucesso! PID: {0}
zh: 守护进程启动成功！PID: {0}

# DAEMON_STOPPED_SUCCESS
source: Daemon stopped successfully!
de: Daemon erfolgreich gestoppt!
es: ¡Daemon detenido con éxito!
fr: Daemon arrêté avec succès !
it: Daemon fermato con successo!
ja: デーモンが正常に停止されました！
pt_br: Daemon parado com sucesso!
zh: 守护进程停止成功！

# DAEMON_ALREADY_RUNNING
source: Daemon is already running!
de: Daemon läuft bereits!
es: ¡El daemon ya está ejecutándose!
fr: Le daemon est déjà en cours d'exécution !
it: Il daemon è già in esecuzione!
ja: デーモンは既に実行中です！
pt_br: Daemon já está em execução!
zh: 守护进程已在运行！

# DAEMON_NOT_RUNNING
source: Daemon is not running!
de: Daemon läuft nicht!
es: ¡El daemon no está ejecutándose!
fr: Le daemon n'est pas en cours d'exécution !
it: Il daemon non è in esecuzione!
ja: デーモンは実行されていません！
pt_br: Daemon não está em execução!
zh: 守护进程未运行！

# DAEMON_STATUS_RUNNING
source: Daemon is running! PID: {0}
de: Daemon läuft! PID: {0}
es: ¡El daemon está ejecutándose! PID: {0}
fr: Le daemon est en cours d'exécution ! PID : {0}
it: Il daemon è in esecuzione! PID: {0}
ja: デーモンは実行中です！PID: {0}
pt_br: Daemon está em execução! PID: {0}
zh: 守护进程正在运行！PID: {0}

# FILE_PROCESSED_SUCCESS
source: File processed successfully: {0}
de: Datei erfolgreich verarbeitet: {0}
es: Archivo procesado con éxito: {0}
fr: Fichier traité avec succès : {0}
it: File elaborato con successo: {0}
ja: ファイルが正常に処理されました: {0}
pt_br: Arquivo processado com sucesso: {0}
zh: 文件处理成功: {0}

# FILE_PROCESSING_ERROR
source: Error processing {0}: {1}
de: Fehler beim Verarbeiten von {0}: {1}
es: Error al procesar {0}: {1}
fr: Erreur lors du traitement de {0} : {1}
it: Errore nell'elaborazione di {0}: {1}
ja: {0}の処理中にエラーが発生しました: {1}
pt_br: Erro ao processar {0}: {1}
zh: 处理文件时出错 {0}: {1}

# CONVERSION_SUCCESS
source: Conversion completed successfully!
de: Konvertierung erfolgreich abgeschlossen!
es: ¡Conversión completada con éxito!
fr: Conversion terminée avec succès !
it: Conversione completata con successo!
ja: 変換が正常に完了しました！
pt_br: Conversão concluída com sucesso!
zh: 转换完成成功！

# CONVERSION_ERROR
source: Conversion failed: {0}
de: Konvertierung fehlgeschlagen: {0}
es: Error en la conversión: {0}
fr: Échec de la conversion : {0}
it: Conversione fallita: {0}
ja: 変換に失敗しました: {0}
pt_br: Falha na conversão: {0}
zh: 转换失败: {0}

# INVALID_ARGUMENTS
source: Invalid arguments. Use --help for usage information.
de: Ungültige Argumente. Verwenden Sie --help für Nutzungsinformationen.
es: Argumentos inválidos. Use --help para información de uso.
fr: Arguments invalides. Utilisez --help pour les informations d'utilisation.
it: Argomenti non validi. Usa --help per informazioni sull'uso.
ja: 無効な引数です。使用方法については--helpを使用してください。
pt_br: Argumentos inválidos. Use --help para informações de uso.
zh: 无效参数。使用--help查看用法信息。

# FILE_NOT_FOUND
source: File not found: {0}
de: Datei nicht gefunden: {0}
es: Archivo no encontrado: {0}
fr: Fichier introuvable : {0}
it: File non trovato: {0}
ja: ファイルが見つかりません: {0}
pt_br: Arquivo não encontrado: {0}
zh: 文件未找到: {0}

# FOLDER_CREATED
source: Folder created: {0}
de: Ordner erstellt: {0}
es: Carpeta creada: {0}
fr: Dossier créé : {0}
it: Cartella creata: {0}
ja: フォルダが作成されました: {0}
pt_br: Pasta criada: {0}
zh: 文件夹已创建: {0}

# STARTING_DAEMON
source: Starting daemon in background...
de: Daemon wird im Hintergrund gestartet...
es: Iniciando daemon en segundo plano...
fr: Démarrage du daemon en arrière-plan...
it: Avvio del daemon in background...
ja: バックグラウンドでデーモンを開始しています...
pt_br: Iniciando daemon em segundo plano...
zh: 正在后台启动守护进程...

# MONITORING_FOLDER
source: Monitored folder: {0}
de: Überwachter Ordner: {0}
es: Carpeta monitoreada: {0}
fr: Dossier surveillé : {0}
it: Cartella monitorata: {0}
ja: 監視フォルダ: {0}
pt_br: Pasta monitorada: {0}
zh: 监控文件夹: {0}

# DIMENSIONS_INFO
source: Dimensions: {0} x {1} {2}
de: Abmessungen: {0} x {1} {2}
es: Dimensiones: {0} x {1} {2}
it: Dimensioni: {0} x {1} {2}
ja: 寸法: {0} x {1} {2}
pt_br: Dimensões: {0} x {1} {2}
zh: 尺寸: {0} x {1} {2}

# PRINT_DENSITY_INFO
source: Print Density: {0:F1} dpmm ({1} dpi)
de: Druckdichte: {0:F1} dpmm ({1} dpi)
es: Densidad de Impresión: {0:F1} dpmm ({1} dpi)
fr: Densité d'impression : {0:F1} dpmm ({1} dpi)
it: Densità di stampa: {0:F1} dpmm ({1} dpi)
ja: 印刷密度: {0:F1} dpmm ({1} dpi)
pt_br: Densidade de Impressão: {0:F1} dpmm ({1} dpi)
zh: 打印密度: {0:F1} dpmm ({1} dpi)

source: Press Ctrl+C to stop...
de: Drücken Sie Strg+C zum Beenden...
es: Presione Ctrl+C para detener...
fr: Appuyez sur Ctrl+C pour arrêter...
it: Premere Ctrl+C per fermare...
ja: 停止するにはCtrl+Cを押してください...
pt_br: Pressione Ctrl+C para parar...
zh: 按Ctrl+C停止...

# HELP_PARAMETERS
source: Parameters:
de: Parameter:
es: Parámetros:
fr: Paramètres :
it: Parametri:
ja: パラメータ:
pt_br: Parâmetros:
zh: 参数:

# HELP_COMMANDS
source: Commands:
de: Befehle:
es: Comandos:
fr: Commandes :
it: Comandi:
ja: コマンド:
pt_br: Comandos:
zh: 命令:

# HELP_DAEMON_OPTIONS
source: Daemon Options:
de: Daemon-Optionen:
es: Opciones del Daemon:
fr: Options du Démon :
it: Opzioni del Demone:
ja: デーモンオプション:
pt_br: Opções do Daemon:
zh: 守护进程选项:

# HELP_SHOW_HELP_MESSAGE
source: Show this help message
de: Diese Hilfe anzeigen
es: Mostrar este mensaje de ayuda
fr: Afficher ce message d'aide
it: Mostra questo messaggio di aiuto
ja: このヘルプメッセージを表示
pt_br: Mostrar esta mensagem de ajuda
zh: 显示此帮助消息

# HELP_DAEMON_DIRECT_OPTIONS
source: You can also pass daemon options directly: ZPL2PDF.exe -l "folder" -w 10 -h 5
de: Sie können auch Daemon-Optionen direkt übergeben: ZPL2PDF.exe -l "Ordner" -w 10 -h 5
es: También puede pasar opciones del daemon directamente: ZPL2PDF.exe -l "carpeta" -w 10 -h 5
fr: Vous pouvez aussi passer les options du démon directement : ZPL2PDF.exe -l "dossier" -w 10 -h 5
it: Puoi anche passare le opzioni del demone direttamente: ZPL2PDF.exe -l "cartella" -w 10 -h 5
ja: デーモンオプションを直接渡すこともできます: ZPL2PDF.exe -l "フォルダ" -w 10 -h 5
pt_br: Você também pode passar opções do daemon diretamente: ZPL2PDF.exe -l "pasta" -w 10 -h 5
zh: 您也可以直接传递守护进程选项: ZPL2PDF.exe -l "文件夹" -w 10 -h 5

# HELP_PARAM_INPUT_FILE
source: -i <input_file_path> Path to the input file (.txt, .prn, .zpl, or .imp)
de: -i <eingabedatei_pfad> Pfad zur Eingabedatei (.txt, .prn, .zpl oder .imp)
es: -i <ruta_archivo_entrada> Ruta al archivo de entrada (.txt, .prn, .zpl o .imp)
fr: -i <chemin_fichier_entrée> Chemin vers le fichier d'entrée (.txt, .prn, .zpl ou .imp)
it: -i <percorso_file_input> Percorso al file di input (.txt, .prn, .zpl o .imp)
ja: -i <入力ファイルパス> 入力ファイルへのパス (.txt, .prn, .zpl, .imp)
pt_br: -i <caminho_arquivo_entrada> Caminho para o arquivo .txt ou .prn de entrada
zh: -i <输入文件路径> 输入文件路径 (.txt, .prn, .zpl 或 .imp)

# HELP_PARAM_ZPL_CONTENT
source: -z <zpl_content> ZPL content as a string
de: -z <zpl_inhalt> ZPL-Inhalt als Zeichenfolge
es: -z <contenido_zpl> Contenido ZPL como cadena
fr: -z <contenu_zpl> Contenu ZPL sous forme de chaîne
it: -z <contenuto_zpl> Contenuto ZPL come stringa
ja: -z <zplコンテンツ> 文字列としてのZPLコンテンツ
pt_br: -z <conteudo_zpl> Conteúdo ZPL como string
zh: -z <zpl内容> ZPL内容作为字符串

# HELP_PARAM_OUTPUT_FOLDER
source: -o <output_folder_path> Path to the folder where the PDF file will be saved
de: -o <ausgabeordner_pfad> Pfad zum Ordner, in dem die PDF-Datei gespeichert wird
es: -o <carpeta_salida> Ruta a la carpeta donde se guardará el archivo PDF
fr: -o <dossier_sortie> Chemin vers le dossier où le fichier PDF sera sauvegardé
it: -o <cartella_output> Percorso alla cartella dove verrà salvato il file PDF
ja: -o <出力フォルダパス> PDFファイルが保存されるフォルダへのパス
pt_br: -o <pasta_saida> Caminho para a pasta onde o arquivo PDF será salvo
zh: -o <输出文件夹路径> PDF文件将保存到的文件夹路径

# HELP_PARAM_OUTPUT_NAME
source: -n <output_file_name> Name of the output PDF file (optional)
de: -n <ausgabedatei_name> Name der Ausgabe-PDF-Datei (optional)
es: -n <nombre_archivo_salida> Nombre del archivo PDF de salida (opcional)
fr: -n <nom_fichier_sortie> Nom du fichier PDF de sortie (optionnel)
it: -n <nome_file_output> Nome del file PDF di output (opzionale)
ja: -n <出力ファイル名> 出力PDFファイルの名前（オプション）
pt_br: -n <nome_arquivo_saida> Nome do arquivo PDF de saída (opcional)
zh: -n <输出文件名> 输出PDF文件的名称（可选）

# HELP_PARAM_WIDTH
source: -w <width> Width of the label (accepts . or , as decimal separator)
de: -w <breite> Breite des Etiketts (akzeptiert . oder , als Dezimaltrennzeichen)
es: -w <ancho> Ancho de la etiqueta (acepta . o , como separador decimal)
fr: -w <largeur> Largeur de l'étiquette (accepte . ou , comme séparateur décimal)
it: -w <larghezza> Larghezza dell'etichetta (accetta . o , come separatore decimale)
ja: -w <幅> ラベルの幅（小数点区切り文字として.または,を受け入れ）
pt_br: -w <largura> Largura da etiqueta (aceita . ou , como separador decimal)
zh: -w <宽度> 标签的宽度（接受.或,作为小数点分隔符）

# HELP_PARAM_HEIGHT
source: -h <height> Height of the label (accepts . or , as decimal separator)
de: -h <höhe> Höhe des Etiketts (akzeptiert . oder , als Dezimaltrennzeichen)
es: -h <alto> Alto de la etiqueta (acepta . o , como separador decimal)
fr: -h <hauteur> Hauteur de l'étiquette (accepte . ou , comme séparateur décimal)
it: -h <altezza> Altezza dell'etichetta (accetta . o , come separatore decimale)
ja: -h <高さ> ラベルの高さ（小数点区切り文字として.または,を受け入れ）
pt_br: -h <altura> Altura da etiqueta (aceita . ou , como separador decimal)
zh: -h <高度> 标签的高度（接受.或,作为小数点分隔符）

# HELP_PARAM_DENSITY
source: -d <density> Print density in DPI (integer only, e.g., 203, 300)
de: -d <dichte> Druckdichte in DPI (nur Ganzzahl, z.B. 203, 300)
es: -d <densidad> Densidad de impresión en DPI (solo entero, ej: 203, 300)
fr: -d <densité> Densité d'impression en DPI (entier uniquement, ex: 203, 300)
it: -d <densità> Densità di stampa in DPI (solo intero, es: 203, 300)
ja: -d <密度> 印刷密度DPI（整数のみ、例：203、300）
pt_br: -d <densidade> Densidade de impressão em DPI (apenas inteiro, ex: 203, 300)
zh: -d <密度> 打印密度DPI（仅整数，例如：203、300）

# HELP_PARAM_UNIT
source: -u <unit> Unit of measurement for width and height ('in', 'cm', 'mm')
de: -u <einheit> Maßeinheit für Breite und Höhe ('in', 'cm', 'mm')
es: -u <unidad> Unidad de medida para ancho y alto ('in', 'cm', 'mm')
fr: -u <unité> Unité de mesure pour largeur et hauteur ('in', 'cm', 'mm')
it: -u <unità> Unità di misura per larghezza e altezza ('in', 'cm', 'mm')
ja: -u <単位> 幅と高さの測定単位（'in'、'cm'、'mm'）
pt_br: -u <unidade> Unidade de medida para largura e altura ('in', 'cm', 'mm')
zh: -u <单位> 宽度和高度的测量单位（'in'、'cm'、'mm'）

# HELP_CMD_START
source: start Start daemon mode in background
de: start Daemon-Modus im Hintergrund starten
es: start Iniciar modo daemon en segundo plano
fr: start Démarrer le mode démon en arrière-plan
it: start Avvia modalità demone in background
ja: start バックグラウンドでデーモンモードを開始
pt_br: start Iniciar modo daemon em segundo plano
zh: start 在后台启动守护进程模式

# HELP_CMD_STOP
source: stop Stop daemon mode
de: stop Daemon-Modus beenden
es: stop Detener modo daemon
fr: stop Arrêter le mode démon
it: stop Ferma modalità demone
ja: stop デーモンモードを停止
pt_br: stop Parar modo daemon
zh: stop 停止守护进程模式

# HELP_CMD_STATUS
source: status Check daemon status
de: status Daemon-Status überprüfen
es: status Verificar estado del daemon
fr: status Vérifier l'état du démon
it: status Verifica stato del demone
ja: status デーモンのステータスを確認
pt_br: status Verificar status do daemon
zh: status 检查守护进程状态

# HELP_CMD_RUN
source: run Run daemon mode in current process (for testing)
de: run Daemon-Modus im aktuellen Prozess ausführen (für Tests)
es: run Ejecutar modo daemon en proceso actual (para pruebas)
fr: run Exécuter le mode démon dans le processus actuel (pour les tests)
it: run Esegui modalità demone nel processo corrente (per test)
ja: run 現在のプロセスでデーモンモードを実行（テスト用）
pt_br: run Executar modo daemon no processo atual (para testes)
zh: run 在当前进程中运行守护进程模式（用于测试）

# HELP_OPT_LISTEN_FOLDER
source: -l <listen_folder> Folder to monitor (default: Documents/ZPL2PDF Auto Converter)
de: -l <überwachungsordner> Zu überwachender Ordner (Standard: Documents/ZPL2PDF Auto Converter)
es: -l <carpeta_monitoreo> Carpeta a monitorear (predeterminado: Documents/ZPL2PDF Auto Converter)
fr: -l <dossier_écoute> Dossier à surveiller (par défaut : Documents/ZPL2PDF Auto Converter)
it: -l <cartella_monitoraggio> Cartella da monitorare (predefinita: Documents/ZPL2PDF Auto Converter)
ja: -l <監視フォルダ> 監視するフォルダ（デフォルト：Documents/ZPL2PDF Auto Converter）
pt_br: -l <pasta_monitoramento> Pasta para monitorar (padrão: Documents/ZPL2PDF Auto Converter)
zh: -l <监听文件夹> 要监听的文件夹（默认：Documents/ZPL2PDF Auto Converter）

# HELP_OPT_WIDTH_FIXED
source: -w <width> Fixed width for all conversions (accepts . or , as decimal separator)
de: -w <breite> Feste Breite für alle Konvertierungen (akzeptiert . oder , als Dezimaltrennzeichen)
es: -w <ancho> Ancho fijo para todas las conversiones (acepta . o , como separador decimal)
fr: -w <largeur> Largeur fixe pour toutes les conversions (accepte . ou , comme séparateur décimal)
it: -w <larghezza> Larghezza fissa per tutte le conversioni (accetta . o , come separatore decimale)
ja: -w <幅> すべての変換に固定幅（小数点区切り文字として.または,を受け入れ）
pt_br: -w <largura> Largura fixa para todas as conversões (aceita . ou , como separador decimal)
zh: -w <宽度> 所有转换的固定宽度（接受.或,作为小数点分隔符）

# HELP_OPT_HEIGHT_FIXED
source: -h <height> Fixed height for all conversions (accepts . or , as decimal separator)
de: -h <höhe> Feste Höhe für alle Konvertierungen (akzeptiert . oder , als Dezimaltrennzeichen)
es: -h <alto> Alto fijo para todas las conversiones (acepta . o , como separador decimal)
fr: -h <hauteur> Hauteur fixe pour toutes les conversions (accepte . ou , comme séparateur décimal)
it: -h <altezza> Altezza fissa per tutte le conversioni (accetta . o , come separatore decimale)
ja: -h <高さ> すべての変換に固定高さ（小数点区切り文字として.または,を受け入れ）
pt_br: -h <altura> Altura fixa para todas as conversões (aceita . ou , como separador decimal)
zh: -h <高度> 所有转换的固定高度（接受.或,作为小数点分隔符）

# HELP_OPT_UNIT_DAEMON
source: -u <unit> Unit of measurement ('in', 'cm', 'mm')
de: -u <einheit> Maßeinheit ('in', 'cm', 'mm')
es: -u <unidad> Unidad de medida ('in', 'cm', 'mm')
fr: -u <unité> Unité de mesure ('in', 'cm', 'mm')
it: -u <unità> Unità di misura ('in', 'cm', 'mm')
ja: -u <単位> 測定単位（'in'、'cm'、'mm'）
pt_br: -u <unidade> Unidade de medida ('in', 'cm', 'mm')
zh: -u <单位> 测量单位（'in'、'cm'、'mm'）

# HELP_OPT_DENSITY_DAEMON
source: -d <density> Print density in DPI (integer only, e.g., 203, 300)
de: -d <dichte> Druckdichte in DPI (nur Ganzzahl, z.B. 203, 300)
es: -d <densidad> Densidad de impresión en DPI (solo entero, ej: 203, 300)
fr: -d <densité> Densité d'impression en DPI (entier uniquement, ex: 203, 300)
it: -d <densità> Densità di stampa in DPI (solo intero, es: 203, 300)
ja: -d <密度> 印刷密度DPI（整数のみ、例：203、300）
pt_br: -d <densidade> Densidade de impressão em DPI (apenas inteiro, ex: 203, 300)
zh: -d <密度> 打印密度DPI（仅整数，例如：203、300）

source: Checking daemon status...
de: Daemon-Status wird überprüft...
es: Verificando estado del daemon...
fr: Vérification de l'état du démon...
it: Verifica stato del demone...
ja: デーモンのステータスを確認中...
pt_br: Verificando status do daemon...
zh: 检查守护进程状态...

source: Stopping daemon...
de: Daemon wird beendet...
es: Deteniendo daemon...
fr: Arrêt du démon...
it: Fermando demone...
ja: デーモンを停止中...
pt_br: Parando daemon...
zh: 停止守护进程...

# DAEMON_STARTED_BUT_FAILED_PID
source: Daemon started but failed to save PID file!
de: Daemon gestartet, aber Fehler beim Speichern der PID-Datei!
es: ¡Daemon iniciado pero falló al guardar archivo PID!
fr: Démon démarré mais échec de sauvegarde du fichier PID !
it: Demone avviato ma fallito nel salvare il file PID!
ja: デーモンが開始されましたが、PIDファイルの保存に失敗しました！
pt_br: Daemon iniciado mas falhou ao salvar arquivo PID!
zh: 守护进程已启动但保存PID文件失败！

# FAILED_TO_START_DAEMON
source: Failed to start daemon process!
de: Fehler beim Starten des Daemon-Prozesses!
es: ¡Error al iniciar proceso del daemon!
fr: Échec du démarrage du processus démon !
it: Errore nell'avviare il processo demone!
ja: デーモンプロセスの開始に失敗しました！
pt_br: Falha ao iniciar processo do daemon!
zh: 启动守护进程失败！

# ERROR_STOPPING_DAEMON
source: Error stopping daemon process!
de: Fehler beim Beenden des Daemon-Prozesses!
es: ¡Error al detener proceso del daemon!
fr: Erreur lors de l'arrêt du processus démon !
it: Errore nel fermare il processo demone!
ja: デーモンプロセスの停止中にエラーが発生しました！
pt_br: Erro ao parar processo do daemon!
zh: 停止守护进程时出错！

source: Invalid PID in file!
de: Ungültige PID in der Datei!
es: ¡PID inválido en el archivo!
fr: PID invalide dans le fichier !
it: PID non valido nel file!
ja: ファイル内のPIDが無効です！
pt_br: PID inválido no arquivo!
zh: 文件中的PID无效！

# NO_IMAGES_GENERATED
source: No images generated from ZPL content!
de: Keine Bilder aus ZPL-Inhalt generiert!
es: ¡No se generaron imágenes del contenido ZPL!
fr: Aucune image générée à partir du contenu ZPL !
it: Nessuna immagine generata dal contenuto ZPL!
ja: ZPLコンテンツから画像が生成されませんでした！
pt_br: Nenhuma imagem gerada a partir do conteúdo ZPL!
zh: 从ZPL内容未生成图像！

source: Starting queue processing...
de: Warteschlangen-Verarbeitung wird gestartet...
es: Iniciando procesamiento de cola...
fr: Démarrage du traitement de la file d'attente...
it: Avvio elaborazione coda...
ja: キュー処理を開始中...
pt_br: Iniciando processamento da fila...
zh: 开始队列处理...

source: Queue processing stopped
de: Warteschlangen-Verarbeitung gestoppt
es: Procesamiento de cola detenido
fr: Traitement de la file d'attente arrêté
it: Elaborazione coda fermata
ja: キュー処理が停止されました
pt_br: Processamento da fila parado
zh: 队列处理已停止

source: Monitoring stopped
de: Überwachung gestoppt
es: Monitoreo detenido
fr: Surveillance arrêtée
it: Monitoraggio fermato
ja: 監視が停止されました
pt_br: Monitoramento parado
zh: 监听已停止

source: Processing files list cleared
de: Liste der verarbeiteten Dateien geleert
es: Lista de archivos procesados limpiada
fr: Liste des fichiers traités effacée
it: Lista file elaborati pulita
ja: 処理済みファイルリストがクリアされました
pt_br: Lista de arquivos processados limpa
zh: 已清除处理文件列表

source: Monitoring folder not configured
de: Überwachungsordner nicht konfiguriert
es: Carpeta de monitoreo no configurada
fr: Dossier de surveillance non configuré
it: Cartella di monitoraggio non configurata
ja: 監視フォルダが設定されていません
pt_br: Pasta de monitoramento não configurada
zh: 监听文件夹未配置

source: Label width must be greater than zero
de: Etikettenbreite muss größer als null sein
es: El ancho de la etiqueta debe ser mayor que cero
fr: La largeur de l'étiquette doit être supérieure à zéro
it: La larghezza dell'etichetta deve essere maggiore di zero
ja: ラベルの幅はゼロより大きい必要があります
pt_br: Largura da etiqueta deve ser maior que zero
zh: 标签宽度必须大于零

source: Label height must be greater than zero
de: Etikettenhöhe muss größer als null sein
es: El alto de la etiqueta debe ser mayor que cero
fr: La hauteur de l'étiquette doit être supérieure à zéro
it: L'altezza dell'etichetta deve essere maggiore di zero
ja: ラベルの高さはゼロより大きい必要があります
pt_br: Altura da etiqueta deve ser maior que zero
zh: 标签高度必须大于零

source: DPI must be greater than zero
de: DPI muss größer als null sein
es: DPI debe ser mayor que cero
fr: DPI doit être supérieur à zéro
it: DPI deve essere maggiore di zero
ja: DPIはゼロより大きい必要があります
pt_br: DPI deve ser maior que zero
zh: DPI必须大于零

# INVALID_UNIT_CONFIG
source: Invalid unit. Use: mm, cm, in, pt
de: Ungültige Einheit. Verwenden Sie: mm, cm, in, pt
es: Unidad inválida. Use: mm, cm, in, pt
fr: Unité invalide. Utilisez : mm, cm, in, pt
it: Unità non valida. Usa: mm, cm, in, pt
ja: 無効な単位。使用：mm、cm、in、pt
pt_br: Unidade inválida. Use: mm, cm, in, pt
zh: 无效单位。使用：mm、cm、in、pt

# INVALID_LOG_LEVEL_CONFIG
source: Invalid log level. Use: Debug, Info, Warning, Error
de: Ungültiges Log-Level. Verwenden Sie: Debug, Info, Warning, Error
es: Nivel de log inválido. Use: Debug, Info, Warning, Error
fr: Niveau de log invalide. Utilisez : Debug, Info, Warning, Error
it: Livello di log non valido. Usa: Debug, Info, Warning, Error
ja: 無効なログレベル。使用：Debug、Info、Warning、Error
pt_br: Nível de log inválido. Use: Debug, Info, Warning, Error
zh: 无效日志级别。使用：Debug、Info、Warning、Error

source: Current ZPL2PDF configuration:
de: Aktuelle ZPL2PDF-Konfiguration:
es: Configuración actual de ZPL2PDF:
fr: Configuration actuelle de ZPL2PDF :
it: Configurazione attuale di ZPL2PDF:
ja: 現在のZPL2PDF設定：
pt_br: Configuração atual do ZPL2PDF:
zh: 当前ZPL2PDF配置：
