Repository: brunoleocam/ZPL2PDF
Catalog: Resources/Messages.*.resx
Languages: de, es, fr, it, ja, pt_br, zh

# MONITORING_FOLDER_CONFIG
source: Monitoring folder: {0}
de: Überwachungsordner: {0}
es: Carpeta de monitoreo: {0}
fr: Dossier de surveillance : {0}
it: Cartella di monitoraggio: {0}
ja: 監視フォルダ：{0}
pt_br: Pasta de monitoramento: {0}
zh: 监听文件夹：{0}

# HELP_LANGUAGE_PARAM
source: --language <language> Interface language (e.g., pt-BR, en-US, es-ES)
de: --language <sprache> Interface-Sprache (z.B. pt-BR, en-US, es-ES)
es: --language <idioma> Idioma de la interfaz (ej: pt-BR, en-US, es-ES)
fr: --language <langue> Langue de l'interface (ex: pt-BR, en-US, es-ES)
it: --language <lingua> Lingua dell'interfaccia (es: pt-BR, en-US, es-ES)
ja: --language <言語> インターフェース言語（例：pt-BR、en-US、es-ES）
pt_br: --language <idioma> Idioma da interface (ex: pt-BR, en-US, es-ES)
zh: --language <语言> 界面语言（例如：pt-BR、en-US、es-ES）

# HELP_SET_LANGUAGE
source: --set-language <language> Set language permanently (sets environment variable)
de: --set-language <sprache> Sprache dauerhaft festlegen (setzt Umgebungsvariable)
es: --set-language <idioma> Configurar idioma permanentemente (configura variable de entorno)
fr: --set-language <langue> Définir la langue de façon permanente (configure la variable d'environnement)
it: --set-language <lingua> Imposta la lingua in modo permanente (imposta la variabile d'ambiente)
ja: --set-language <言語> 言語を永続的に設定（環境変数を設定）
pt_br: --set-language <idioma> Definir idioma permanentemente (configura variável de ambiente)
zh: --set-language <语言> 永久设置语言（设置环境变量）

# HELP_RESET_LANGUAGE
source: --reset-language Reset to system default language
de: --reset-language Zurücksetzen auf Systemstandardsprache
es: --reset-language Restablecer al idioma predeterminado del sistema
fr: --reset-language Réinitialiser à la langue par défaut du système
it: --reset-language Reimposta alla lingua predefinita del sistema
ja: --reset-language システムデフォルト言語にリセット
pt_br: --reset-language Resetar para idioma padrão do sistema
zh: --reset-language 重置为系统默认语言

# HELP_SHOW_LANGUAGE
source: --show-language Show current language configuration
de: --show-language Aktuelle Sprachenkonfiguration anzeigen
es: --show-language Mostrar configuración de idioma actual
fr: --show-language Afficher la configuration de langue actuelle
it: --show-language Mostra la configurazione della lingua corrente
ja: --show-language 現在の言語設定を表示
pt_br: --show-language Mostrar configuração de idioma atual
zh: --show-language 显示当前语言配置

# INVALID_LANGUAGE_CODE
source: Invalid language code: {0}
de: Ungültiger Sprachcode: {0}
es: Código de idioma inválido: {0}
fr: Code de langue invalide : {0}
it: Codice lingua non valido: {0}
pt_br: Código de idioma inválido: {0}
zh: 无效的语言代码: {0}

# SUPPORTED_LANGUAGES_LIST
source: Supported languages:
de: Unterstützte Sprachen:
es: Idiomas soportados:
fr: Langues prises en charge :
it: Lingue supportate:
pt_br: Idiomas suportados:
zh: 支持的语言:

# LANGUAGE_SET_SUCCESS
source: Language set to: {0}
de: Sprache festgelegt auf: {0}
es: Idioma configurado a: {0}
fr: Langue définie sur : {0}
it: Lingua impostata su: {0}
pt_br: Idioma configurado para: {0}
zh: 语言已设置为: {0}

# LANGUAGE_RESET_SUCCESS
source: Language configuration reset to system default
de: Sprachenkonfiguration auf Systemstandard zurückgesetzt
es: Configuración de idioma restablecida al predeterminado del sistema
fr: Configuration de langue réinitialisée à la valeur par défaut du système
it: Configurazione della lingua reimpostata al predefinito del sistema
pt_br: Configuração de idioma resetada para padrão do sistema
zh: 语言配置已重置为系统默认值

# RESTART_REQUIRED
source: Please restart your terminal/command prompt for changes to take effect.
de: Bitte starten Sie Ihr Terminal/Eingabeaufforderung neu, damit die Änderungen wirksam werden.
es: Por favor, reinicie su terminal/símbolo del sistema para que los cambios surtan efecto.
fr: Veuillez redémarrer votre terminal/invite de commande pour que les modifications prennent effet.
it: Si prega di riavviare il terminale/prompt dei comandi per rendere effettive le modifiche.
pt_br: Por favor, reinicie seu terminal/prompt de comando para que as alterações tenham efeito.
zh: 请重新启动终端/命令提示符以使更改生效。

# ERROR_SETTING_LANGUAGE
source: Error setting language: {0}
de: Fehler beim Festlegen der Sprache: {0}
es: Error al configurar idioma: {0}
fr: Erreur lors de la définition de la langue : {0}
it: Errore nell'impostazione della lingua: {0}
pt_br: Erro ao configurar idioma: {0}
zh: 设置语言时出错: {0}

# ERROR_RESETTING_LANGUAGE
source: Error resetting language: {0}
de: Fehler beim Zurücksetzen der Sprache: {0}
es: Error al restablecer idioma: {0}
fr: Erreur lors de la réinitialisation de la langue : {0}
it: Errore nel ripristino della lingua: {0}
pt_br: Erro ao resetar idioma: {0}
zh: 重置语言时出错: {0}

# CURRENT_LANGUAGE_CONFIG
source: Current Language Configuration:
de: Aktuelle Sprachenkonfiguration:
es: Configuración de Idioma Actual:
fr: Configuration de langue actuelle :
it: Configurazione della lingua corrente:
pt_br: Configuração de Idioma Atual:
zh: 当前语言配置:

# ENV_VAR_LANGUAGE
source: Environment Variable: {0}
de: Umgebungsvariable: {0}
es: Variable de Entorno: {0}
fr: Variable d'environnement : {0}
it: Variabile d'ambiente: {0}
pt_br: Variável de Ambiente: {0}
zh: 环境变量: {0}

# ENV_VAR_NOT_SET
source: Environment Variable: Not set
de: Umgebungsvariable: Nicht gesetzt
es: Variable de Entorno: No configurada
fr: Variable d'environnement : Non définie
it: Variabile d'ambiente: Non impostata
pt_br: Variável de Ambiente: Não definida
zh: 环境变量: 未设置

# CURRENT_LANGUAGE
source: Current Language: {0}
de: Aktuelle Sprache: {0}
es: Idioma Actual: {0}
fr: Langue actuelle : {0}
it: Lingua corrente: {0}
pt_br: Idioma Atual: {0}
zh: 当前语言: {0}

# SYSTEM_LANGUAGE
source: System Language: {0}
de: Systemsprache: {0}
es: Idioma del Sistema: {0}
fr: Langue du système : {0}
it: Lingua del sistema: {0}
pt_br: Idioma do Sistema: {0}
zh: 系统语言: {0}

# LANGUAGE_PRIORITY_ORDER
source: Priority: 1) --language param, 2) Environment variable, 3) Config file, 4) System detection
de: Priorität: 1) --language Parameter, 2) Umgebungsvariable, 3) Config-Datei, 4) Systemerkennung
es: Prioridad: 1) Parámetro --language, 2) Variable de entorno, 3) Archivo config, 4) Detección del sistema
fr: Priorité : 1) Paramètre --language, 2) Variable d'environnement, 3) Fichier config, 4) Détection du système
it: Priorità: 1) Parametro --language, 2) Variabile d'ambiente, 3) File config, 4) Rilevamento del sistema
pt_br: Prioridade: 1) Parâmetro --language, 2) Variável de ambiente, 3) Arquivo config, 4) Detecção do sistema
zh: 优先级: 1) --language 参数、2) 环境变量、3) 配置文件、4) 系统检测

# HELP_TCP_SERVER_MODE
source: TCP SERVER MODE (Virtual Printer):
de: TCP-SERVER-MODUS:
es: MODO SERVIDOR TCP:
fr: MODE SERVEUR TCP :
it: MODO SERVER TCP:
ja: TCPサーバーモード（仮想プリンター）:
zh: TCP服务器模式:

# HELP_TCP_SERVER_USAGE
source: Usage: ZPL2PDF.exe server start [options] | stop | status
de: Verwendung: ZPL2PDF.exe server start [Optionen] | stop | status
es: Uso: ZPL2PDF.exe server start [opciones] | stop | status
it: Uso: ZPL2PDF.exe server start [opzioni] | stop | status
ja: 使用方法: ZPL2PDF.exe server start [オプション] | stop | status
zh: 用法: ZPL2PDF.exe server start [选项] | stop | status

# HELP_PARAM_RENDERER
source: --renderer <mode> Rendering engine: 'offline' (BinaryKits), 'labelary' (API), 'auto' (fallback)
de: --renderer <engine> Rendering-Engine: offline (BinaryKits), labelary (API) oder auto (Fallback)
es: --renderer <engine> Motor de renderizado: offline (BinaryKits), labelary (API) o auto (fallback)
fr: --renderer <engine> Moteur de rendu : offline (BinaryKits), labelary (API) ou auto (fallback)
it: --renderer <engine> Motore di rendering: offline (BinaryKits), labelary (API) o auto (fallback)
ja: --renderer <モード> レンダリングエンジン: 'offline' (BinaryKits)、'labelary' (API)、'auto' (フォールバック)
zh: --renderer <引擎> 渲染引擎: offline (BinaryKits)、labelary (API) 或 auto (回退)

# HELP_PARAM_FONTS_DIR
source: --fonts-dir <folder> Directory with custom TrueType fonts (.ttf, .otf)
de: --fonts-dir <verzeichnis> Verzeichnis mit benutzerdefinierten TrueType/OpenType-Schriftarten
es: --fonts-dir <directorio> Directorio que contiene fuentes TrueType/OpenType personalizadas
fr: --fonts-dir <repertoire> Répertoire contenant des polices TrueType/OpenType personnalisées
it: --fonts-dir <directory> Directory contenente font TrueType/OpenType personalizzati
ja: --fonts-dir <フォルダ> カスタムTrueTypeフォントのディレクトリ（.ttf、.otf）
zh: --fonts-dir <目录> 包含自定义TrueType/OpenType字体的目录

# HELP_PARAM_FONT
source: --font <ID=path> Map specific font (e.g., --font "A=C:\Fonts\arial.ttf")
de: --font <id=pfad> Schrift-ID auf Schriftdatei zuordnen (z.B. "A=arial.ttf")
es: --font <id=ruta> Mapear ID de fuente a archivo de fuente (ej: "A=arial.ttf")
fr: --font <id=chemin> Mapper l'ID de police au fichier de police (ex : "A=arial.ttf")
it: --font <id=percorso> Mappa ID font al file font (es: "A=arial.ttf")
ja: --font <ID=パス> 特定のフォントをマップ（例：--font "A=C:\Fonts\arial.ttf"）
zh: --font <id=路径> 将字体ID映射到字体文件（例如: "A=arial.ttf"）

# HELP_ADVANCED_OPTIONS
source: ADVANCED OPTIONS:
ja: 高度なオプション:

# HELP_TCP_CMD_START
source: server start Start TCP server (virtual printer)
ja: server start TCPサーバーを開始（仮想プリンター）

# HELP_TCP_CMD_STOP
source: server stop Stop TCP server
ja: server stop TCPサーバーを停止

# HELP_TCP_CMD_STATUS
source: server status Check TCP server status
ja: server status TCPサーバーのステータスを確認

# HELP_TCP_OPT_PORT
source: --port <port> TCP port to listen on (default: 9101)
ja: --port <ポート> リッスンするTCPポート（デフォルト：9101）

# HELP_TCP_OPT_FOREGROUND
source: --foreground Run server in foreground (not background)
ja: --foreground フォアグラウンドでサーバーを実行（バックグラウンドではなく）
